agency-services-transunion/src/examples/lastreq.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <ns1:IndicativeEnrichment xmlns:ns1="https://consumerconnectws.tui.transunion.com/">
      <ns1:request>
        <ns2:AccountCode xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">123456789</ns2:AccountCode>
        <ns2:AccountName xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">CC2BraveCredit</ns2:AccountName>
        <ns2:AdditionalInputs xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">
          <ns2:Data>
            <ns2:Name>CreditReportVersion</ns2:Name>
            <ns2:Value>7</ns2:Value>
          </ns2:Data>
        </ns2:AdditionalInputs>
        <ns2:RequestKey xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">076b9ae3-9a5c-45ea-8b76-4377168e1650</ns2:RequestKey>
        <ns2:ClientKey xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">22545f5a-3a68-42f2-8be9-9d639edbb958</ns2:ClientKey>
        <ns2:Customer xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">
          <ns2:CurrentAddress>
            <ns2:AddressLine1>1202 Main St</ns2:AddressLine1>
            <ns2:AddressLine2 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns2:City>Fort Wayne</ns2:City>
            <ns2:State>IN</ns2:State>
            <ns2:Zipcode>46808</ns2:Zipcode>
          </ns2:CurrentAddress>
          <ns2:DateOfBirth>2021-06-01T00:00:00.000Z</ns2:DateOfBirth>
          <ns2:FullName>
            <ns2:FirstName>Charles</ns2:FirstName>
            <ns2:LastName>FAULCON</ns2:LastName>
            <ns2:MiddleName>L</ns2:MiddleName>
            <ns2:Prefix xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns2:Suffix xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
          </ns2:FullName>
          <ns2:PreviousAddress>
            <ns2:AddressLine1 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns2:AddressLine2 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns2:City xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns2:State xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <ns2:Zipcode xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
          </ns2:PreviousAddress>
          <ns2:Ssn>000003657</ns2:Ssn>
        </ns2:Customer>
        <ns2:ServiceBundleCode xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">CC2BraveCreditIndicativeEnrichment</ns2:ServiceBundleCode>
      </ns1:request>
    </ns1:IndicativeEnrichment>
  </soap:Body>
</soap:Envelope>